---
type: RevitLinkGraphicsSettings
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# RevitLinkGraphicsSettings

`Autodesk.Revit.DB.RevitLinkGraphicsSettings` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | RevitLinkGraphicsSettings | 2024 | `public RevitLinkGraphicsSettings ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | LinkVisibilityType | 2024 | `public LinkVisibility LinkVisibilityType { get ; set ; }` |
| Property | LinkedViewId | 2024 | `public ElementId LinkedViewId { get ; set ; }` |